app/Http/Controllers/PostController.php

    public function index()
    {
        # code...
        return view('posts', [
            "title" => "Posts",
            "posts" => Post::all() //Post = Models, all = eloquent/collect array
        ]);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC